Autodesk.Revit.DB.DisplayUnitType.DUT_RATIO_TO_1
ratio to 1

Autodesk.Revit.DB.DisplayUnitType.DUT_LITERS_PER_HOUR
liters per hour

Autodesk.Revit.DB.DisplayUnitType.DUT_CUBIC_FEET_PER_HOUR
cubic feet per hour

Autodesk.Revit.DB.DisplayUnitType.DUT_STATIONING_FEET
stationing feet value (XXX+YY.ZZZ Decimal Feet (base is always 100 feet, YY is always 2 digits) 1024.555 = 10+24.555)

Autodesk.Revit.DB.DisplayUnitType.DUT_STATIONING_METERS
stationing meters value (XXX+YYY.ZZZ (base is always 1000 meters, YYY is always 3 digits) 1024.555 = 1+024.555)